{
    "first name": "Le",
    "middle name": "Ngoc",
    "last name": "Duc",
    "email": "lengocduc195@gmail.com",
    "phone": "0822.182.195",
    "website": "https://lengocduc195.github.io/",
    "github": "https://github.com/lengocduc195",
    "education": [
        {
            "name": "Nguyen Du Gifted High School",
            "degree": "High School",
            "date": "AUG 2017 - JUL 2020",
            "area": "Mathematics",
            "summary": "",
            "location": "Dak Lak, VN"
        },
        {
            "name": "Ho Chi Minh City University of Science",
            "degree": "Bs",
            "date": "AUG 2020 - DEC 2024",
            "area": "Technology (Computer Science)",
            "summary": "Developing predictive methods for disease risk assessment based on patient's medical history.",
            "location": "Ho Chi Minh, VN"
        },
        {
            "name": "AI Vietnam",
            "degree": "Certificate",
            "date": "AUG 2023 - AUG 2024",
            "area": "Computer Science",
            "summary": "AI Vietnam offers beginner-level training in AI, covering Time Series, NLP, and Computer Vision with a hands-on approach.",
            "location": "Ho Chi Minh, VN"
        }
    ],
    "work": [
        {
            "name": "Computer Science Lab",
            "position": "AI Researcher",
            "date": "JUN 2023 - PRESENT",
            "summary": "My work involves mentoring and advising research groups specializing in Explainable AI (XAI) for Computer Vision. I guide researchers in developing interpretability techniques, evaluating AI model explanations, and identifying reasoning vulnerabilities in deep learning systems. My focus is on enhancing the transparency, reliability, and accountability of AI-driven vision models. Through this role, I contribute to advancing XAI research, fostering collaboration, and ensuring that AI systems provide meaningful and trustworthy explanations.",
            "location": "Ho Chi Minh, VN (Remote)"
        },
        {
            "name": "AI Vietnam Lab",
            "position": "AI Researcher",
            "date": "OCT 2023 - MAR 2024",
            "summary": "Our research focuses on developing and evaluating Large Language Models (LLMs) for the Vietnamese language. We aim to enhance the understanding, generation, and adaptation of LLMs to Vietnamese by addressing linguistic challenges such as tone variations, complex syntax, and limited high-quality datasets. ",
            "location": "Ho Chi Minh, VN (Remote)"
        }
    ]
}